1m3_27mm_wall_H2_test_87/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo; //hePsiThermo;
    mixture         multiComponentMixture;  //singleStepReactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

species
(
    air
    H2
);
inertSpecie air;

air  //GRI3.0
{
    specie
    {
        molWeight       28.850334; 
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.001379e+00 1.486950e-03 -6.082690e-07 1.237554e-10 -9.886221e-15 -9.575864e+02 5.869796e+00 );
        lowCpCoeffs     ( 3.400271e+00 4.831955e-04 -1.063012e-06 2.423725e-09 -1.250252e-12 -1.029939e+03 3.888906e+00 );
    }
    transport
    {
        As              1.459e-06; //Frank White 2006, 190 - 2000 K, As corrected using OF model
        Ts              111;
    }
}

H2
{
    specie
    {
        molWeight       2.01588;    // Molecular weight in g/mol
    }
    thermodynamics //GRI3.0
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 3.337279e+00 -4.940247e-05 4.994568e-07 -1.795664e-10 2.002554e-14 -9.501589e+02 -3.205023e+00 );
        lowCpCoeffs     ( 2.344331e+00 7.980521e-03 -1.947815e-05 2.015721e-08 -7.376118e-12 -9.179352e+02 6.830102e-01 );
    }
    transport
    {
        As              6.897e-07; //Frank White 206, 220 - 1100 K, As corrected using OF model
        Ts              97;
    }
}


// ************************************************************************* //
